QuickRecon/DiveCANHead/atpack/avrasm/inc/AVR32EA48def.inc
; Definitions used by the assembler
#pragma AVRPART MEMORY PROG_FLASH 0x8000
#pragma AVRPART MEMORY EEPROM 0x0200
#pragma AVRPART MEMORY INT_SRAM SIZE 0x1000
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x7000

; ***** INTERRUPT VECTORS, ABSOLUTE ADDRESSES ****************************
; NMI interrupt vectors
.equ NMI_vect = 0x0002                   ; 

; BOD interrupt vectors
.equ BOD_VLM_vect = 0x0004               ; 

; CLKCTRL interrupt vectors
.equ CLKCTRL_CFD_vect = 0x0006           ; 

; RTC interrupt vectors
.equ RTC_CNT_vect = 0x0008               ; 
.equ RTC_PIT_vect = 0x000A               ; 

; CCL interrupt vectors
.equ CCL_CCL_vect = 0x000C               ; 

; PORTA interrupt vectors
.equ PORTA_PORT_vect = 0x000E            ; 

; TCA0 interrupt vectors
.equ TCA0_LUNF_vect = 0x0010             ; 
.equ TCA0_OVF_vect = 0x0010              ; 
.equ TCA0_HUNF_vect = 0x0012             ; 
.equ TCA0_CMP0_vect = 0x0014             ; 
.equ TCA0_LCMP0_vect = 0x0014            ; 
.equ TCA0_CMP1_vect = 0x0016             ; 
.equ TCA0_LCMP1_vect = 0x0016            ; 
.equ TCA0_CMP2_vect = 0x0018             ; 
.equ TCA0_LCMP2_vect = 0x0018            ; 

; TCB0 interrupt vectors
.equ TCB0_INT_vect = 0x001A              ; 

; TCB1 interrupt vectors
.equ TCB1_INT_vect = 0x001C              ; 

; TWI0 interrupt vectors
.equ TWI0_TWIS_vect = 0x001E             ; 
.equ TWI0_TWIM_vect = 0x0020             ; 

; SPI0 interrupt vectors
.equ SPI0_INT_vect = 0x0022              ; 

; USART0 interrupt vectors
.equ USART0_RXC_vect = 0x0024            ; 
.equ USART0_DRE_vect = 0x0026            ; 
.equ USART0_TXC_vect = 0x0028            ; 

; PORTD interrupt vectors
.equ PORTD_PORT_vect = 0x002A            ; 

; AC0 interrupt vectors
.equ AC0_AC_vect = 0x002C                ; 

; ADC0 interrupt vectors
.equ ADC0_ERROR_vect = 0x002E            ; 
.equ ADC0_RESRDY_vect = 0x0030           ; 
.equ ADC0_SAMPRDY_vect = 0x0032          ; 

; AC1 interrupt vectors
.equ AC1_AC_vect = 0x0034                ; 

; PORTC interrupt vectors
.equ PORTC_PORT_vect = 0x0036            ; 

; TCB2 interrupt vectors
.equ TCB2_INT_vect = 0x0038              ; 

; USART1 interrupt vectors
.equ USART1_RXC_vect = 0x003A            ; 
.equ USART1_DRE_vect = 0x003C            ; 
.equ USART1_TXC_vect = 0x003E            ; 

; PORTF interrupt vectors
.equ PORTF_PORT_vect = 0x0040            ; 

; NVMCTRL interrupt vectors
.equ NVMCTRL_EEREADY_vect = 0x0042       ; 
.equ NVMCTRL_FLREADY_vect = 0x0042       ; 
.equ NVMCTRL_NVMREADY_vect = 0x0042      ; 

; USART2 interrupt vectors
.equ USART2_RXC_vect = 0x0044            ; 
.equ USART2_DRE_vect = 0x0046            ; 
.equ USART2_TXC_vect = 0x0048            ; 

; TCB3 interrupt vectors
.equ TCB3_INT_vect = 0x004A              ; 

; TCA1 interrupt vectors
.equ TCA1_LUNF_vect = 0x004C             ; 
.equ TCA1_OVF_vect = 0x004C              ; 
.equ TCA1_HUNF_vect = 0x004E             ; 
.equ TCA1_CMP0_vect = 0x0050             ; 
.equ TCA1_LCMP0_vect = 0x0050            ; 
.equ TCA1_CMP1_vect = 0x0052             ; 
.equ TCA1_LCMP1_vect = 0x0052            ; 
.equ TCA1_CMP2_vect = 0x0054             ; 
.equ TCA1_LCMP2_vect = 0x0054            ; 

; PORTE interrupt vectors
.equ PORTE_PORT_vect = 0x0056            ; 

; PORTB interrupt vectors
.equ PORTB_PORT_vect = 0x0058            ; 



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ NMI_vbase = 0x0002
.equ BOD_vbase = 0x0004
.equ CLKCTRL_vbase = 0x0006
.equ RTC_vbase = 0x0008
.equ CCL_vbase = 0x000C
.equ PORTA_vbase = 0x000E
.equ TCA0_vbase = 0x0010
.equ TCB0_vbase = 0x001A
.equ TCB1_vbase = 0x001C
.equ TWI0_vbase = 0x001E
.equ SPI0_vbase = 0x0022
.equ USART0_vbase = 0x0024
.equ PORTD_vbase = 0x002A
.equ AC0_vbase = 0x002C
.equ ADC0_vbase = 0x002E
.equ AC1_vbase = 0x0034
.equ PORTC_vbase = 0x0036
.equ TCB2_vbase = 0x0038
.equ USART1_vbase = 0x003A
.equ PORTF_vbase = 0x0040
.equ NVMCTRL_vbase = 0x0042
.equ USART2_vbase = 0x0044
.equ TCB3_vbase = 0x004A
.equ TCA1_vbase = 0x004C
.equ PORTE_vbase = 0x0056
.equ PORTB_vbase = 0x0058


; ***** INTERRUPT VECTORS, VECTOR OFFSETS ********************************

; NMI interrupt vector offsets

.equ NMI_voffset = 0

; BOD interrupt vector offsets

.equ BOD_VLM_voffset = 0

; CLKCTRL interrupt vector offsets

.equ CLKCTRL_CFD_voffset = 0

; RTC interrupt vector offsets

.equ RTC_CNT_voffset = 0
.equ RTC_PIT_voffset = 2

; CCL interrupt vector offsets

.equ CCL_CCL_voffset = 0

; PORTA interrupt vector offsets

.equ PORTA_PORT_voffset = 0

; TCA0 interrupt vector offsets

.equ TCA0_LUNF_voffset = 0
.equ TCA0_OVF_voffset = 0
.equ TCA0_HUNF_voffset = 2
.equ TCA0_CMP0_voffset = 4
.equ TCA0_LCMP0_voffset = 4
.equ TCA0_CMP1_voffset = 6
.equ TCA0_LCMP1_voffset = 6
.equ TCA0_CMP2_voffset = 8
.equ TCA0_LCMP2_voffset = 8

; TCB0 interrupt vector offsets

.equ TCB0_INT_voffset = 0

; TCB1 interrupt vector offsets

.equ TCB1_INT_voffset = 0

; TWI0 interrupt vector offsets

.equ TWI0_TWIS_voffset = 0
.equ TWI0_TWIM_voffset = 2

; SPI0 interrupt vector offsets

.equ SPI0_INT_voffset = 0

; USART0 interrupt vector offsets

.equ USART0_RXC_voffset = 0
.equ USART0_DRE_voffset = 2
.equ USART0_TXC_voffset = 4

; PORTD interrupt vector offsets

.equ PORTD_PORT_voffset = 0

; AC0 interrupt vector offsets

.equ AC0_AC_voffset = 0

; ADC0 interrupt vector offsets

.equ ADC0_ERROR_voffset = 0
.equ ADC0_RESRDY_voffset = 2
.equ ADC0_SAMPRDY_voffset = 4

; AC1 interrupt vector offsets

.equ AC1_AC_voffset = 0

; PORTC interrupt vector offsets

.equ PORTC_PORT_voffset = 0

; TCB2 interrupt vector offsets

.equ TCB2_INT_voffset = 0

; USART1 interrupt vector offsets

.equ USART1_RXC_voffset = 0
.equ USART1_DRE_voffset = 2
.equ USART1_TXC_voffset = 4

; PORTF interrupt vector offsets

.equ PORTF_PORT_voffset = 0

; NVMCTRL interrupt vector offsets

.equ NVMCTRL_EEREADY_voffset = 0
.equ NVMCTRL_FLREADY_voffset = 0
.equ NVMCTRL_NVMREADY_voffset = 0

; USART2 interrupt vector offsets

.equ USART2_RXC_voffset = 0
.equ USART2_DRE_voffset = 2
.equ USART2_TXC_voffset = 4

; TCB3 interrupt vector offsets

.equ TCB3_INT_voffset = 0

; TCA1 interrupt vector offsets

.equ TCA1_LUNF_voffset = 0
.equ TCA1_OVF_voffset = 0
.equ TCA1_HUNF_voffset = 2
.equ TCA1_CMP0_voffset = 4
.equ TCA1_LCMP0_voffset = 4
.equ TCA1_CMP1_voffset = 6
.equ TCA1_LCMP1_voffset = 6
.equ TCA1_CMP2_voffset = 8
.equ TCA1_LCMP2_voffset = 8

; PORTE interrupt vector offsets

.equ PORTE_PORT_voffset = 0

; PORTB interrupt vector offsets

.equ PORTB_PORT_voffset = 0



.equ INT_VECTORS_SIZE = 90 ; size in words


#endif /* _AVR32EA48DEF_INC_ */

; ***** END OF FILE ******************************************************



